Repository: 84000/translation-memory-resources
Catalog: post_input/toh287-C.bo.en.tmx
Source language: bo
Languages: en

source: དེ་ནས་ དེ་ འཇུག་པ་ ན །_ འཇིག་རྟེན་ སྐྱོང་བ་ རྣམས་ བྲེད་སྐད་ འབྱིན་ ཅིང་ །_ བརྒྱ་བྱིན་ གྱི་ དྲུང་ དུ་ ཕྱིན་ ནས །_
en: $299 “The guardians of the world will then come before Śakra and tell him in trembling voices,

source: འདི་ལྟར་ ལྷ འི་ དབང་པོ་ ལྷ་ རྣམས་ ཕམ་པ ར་ བྱ་བ འི་ ཕྱིར་ རབ་དགོད་ དང་ །_ ཐགས་ བཟངས་ རིས་ དག་ མཆི་ སྟེ །_
en: ‘Ruler of the gods, the asura rulers Overjoyed and Vemacitrin are intent on defeating the gods.

source: འདི་ལྟར་ རྒྱ་མཚོ་ ཐམས་ཅད་ རབ་ཏུ་ དཀྲུགས །_ རི་བོ ར་ གཏོགས་པ་ སྟོང་ རབ་ཏུ་གཡོ་ བར་ བགྱིད །_
en: They have stirred the entire ocean and shaken the mountains in a thousand different ways.

source: ལྷ་མ་ ཡིན་ རྣམས་ སྒྲ་ འཇེབས་པ ར་ འབྱིན་ ཏེ །_ ཤིན་ཏུ་ འཇིགས་པ འི་ སྒྲ་ ཐོས་ སོ །_། གང་ ཐོས་ ནས་ རྒྱ་མཚོ་ ན་ གནས་པ་ ཉ་ དང་ ཀླུ་ དག་ ཀྱང་ མཐུ་ ཆུང་བ ར་ གྱུར །_ |#| སྲིན་པོ་ དང་ ཤ་ཟ་ དག་ ཀྱང་ གུམ་པ ར་ གྱུར །_
en: The asuras have produced an awesome, terrifying sound that pains the fish and nāgas in the sea and intimidates even the rākṣasas and piśācas.

source: ཀླུ འི་ རྒྱལ་པོ་ ཆོས་ དང་ མི་ ལྡན་པ་ རབ་ འཇོམས་ ལ་སོགས་པ་ ནི་ ཤིན་ཏུ་ དགའ་ ནས །_ འབྲུག་སྒྲ་ འབྱིན །_ ཀླུ འི་ རྒྱལ་པོ་ ཆོས་ [41a] དང་ ལྡན་པ་ འཇོག་པོ་ དང་ །_ ནོར་ རྒྱས་ ཀྱི་ བུ་ ལ་སོགས་པ་ ནི་ འདི་ལྟར་ ལྷ་མ་ ཡིན་ གྱི་ དབང་པོ་ ཐགས་ བཟངས་ རིས་ ས འི་ འོག་ ནས་ བྱུང་ ངོ་ སྙམ་ ནས ཡིད་ དམན་པ ར་ གྱུར་ ཏེ །_ འབྲུག་སྒྲ་ མི་ སྒྲོགས །_
en: The sound thoroughly emboldens Pramatha and other such unrighteous nāga kings, so that they make thunderclaps. [41.a] On the other hand, thinking that the asura kings Vemacitrin and Overjoyed are on the way, the righteous nāga kings, such as Takṣaka and Vāsuki, have become downcast and do not create any thunder.

source: གསེར་ གྱི་ རི་བོ་ དྲུག་ ཁྲི་ རི་རབ་ དང་ བཅས་པ་ གང་ཡིན་པ་ དེ་དག་ ཐམས་ཅད་ ཀྱང་ གཡོ་ བར་ བགྱིད །_
en: Sixty thousand gold mountains, and Mount Sumeru as well, have been rumbling.

source: འབྱུང་པོ་ ཐམས་ཅད་ ཀྱང་ སྒྱིད་ལུག་ པར་ གྱུར་ ནས །_ ཕྲེང་ཐོགས་ དང་ །_ རྟག་ ཏུ་ མྱོས་ གནས་ དང་ །_ ལག་ ན་ཡོལ་ གོ་ ཐོགས་པ་ དང་ །_ པི་ བང་ ཅན་ གསུམ་པ་ ཤིན་ཏུ་ སྒྱིད་ལུག་པ་ རྣམས་ ཀྱིས་ བདག་ ལྷ འི་ དབང་པོ འི་ དྲུང་ དུ་ མངགས་པ་ ལགས་ ན །_ ལྷ་ ལན་ དུ་ བགྱི་བ་ གང་ ལགས་པ་ དེ་ བསྒྲུབ་ ཏུ་ གསོལ །_
en: All the spirits have lost heart and thus the garland bearers, the ever-infatuated, the vessel bearers, and the triple-lute-bearers have become extremely dejected. They have therefore sent us before you, ruler of the gods, with the request that you offer a proper response from the gods.

source: འདི་ལྟར་ བདག་ཅག་ རྣམས་ ཀྱིས་ ནི་ གནས་ གསུམ་ དུ་ གཏོགས་པ འི་ ལྷ་མ་ ཡིན་ གྱི་ དབང་པོ་ གསུམ་པོ་ མེ་ཏོག་ ཕྲེང་ དང་ །_ སྒྲ་གཅན་ དང་ །_ བརྟན་པ་ དག་ གཡུལ་ དུ་ ལན་ བརྒྱ་ འམ་ སྟོང་ དུ་ ཐུབ་ ལགས་སོ །_།
en: We, for our part, have already won hundreds and thousands of times over the asura rulers of the three levels: Puṣpamāla, Rāhu, and Firm.’

source: འཇིག་རྟེན་ སྐྱོང་བ་ རྣམས་ ལས་ དེ་སྐད་ ཐོས་ ནས ལྷ འི་ དབང་པོ ས་ དེ་དག་ ལ་ སྨྲས་པ །_
en: $300 “In response to these words from the guardians of the world, the ruler of the gods will say,

source: འཇིག་རྟེན་ སྐྱོང་བ་ རྣམས་ འདི་དག་ ཐམས་ཅད་ ཇི་ལྟ་བ་ བཞིན་ བདག་ གིས་ རིག་ སྟེ །_
en: ‘Guardians of the world, I am completely aware of all this.

source: འདི་ལྟར་ རབ་དགོད་ དང་ ཐགས་ བཟངས་ རིས་ དག་ཆ ས་པ འི་ ཕྱིར་ བདག་ ཀྱང་ དེ་དག་ ཆད་པ ས་ གཅད་པ་ དང་ །_
en: Overjoyed and Vemacitrin have set out, and now I am here to punish them.

source: ལྷ་ དེ་ རྣམས་ ཀྱི་ སྐྱབས་ དང་ དཔུང་ བྱ་བ འི་ ཕྱིར་ འདི་ལྟར་ བདག་ འགྲོ་བ ར་ བྱ འོ །_།
en: I am here to protect and guard those gods, and that is how I shall proceed.

source: བདག་ ནི་ ཆོས་ ཀྱི་ སྐྱབས །_ ཆོས་ ཀྱི་ དཔུང་གཉེན །_ ཆོས་ ཀྱི་ རྟེན །_ ཆོས་ ཀྱི་ རྒྱལ་མཚན །_ ཆོས་ ཚོལ་བ་ ཡིན་ ཏེ །_
en: I am the protector of the Dharma, the guardian of the Dharma, the support of the Dharma, the victory banner of the Dharma, the patron of the Dharma.

source: བདག་ ནི་ ཆོས་མ་ ཡིན་པ་ ལ་ མི་ དགའ་ ལ །_ ཆོས་མ་ ཡིན་པ་ ལ་ ཡིད་ ཀྱང་ མི་ འཇུག་ གོ །_།
en: I do not like non-Dharma and have no concern for non-Dharma.

source: དེ་ལྟ ར་ བདག་ཅག་ ཡོན་ཏན་ དེ་ལྟ་ བུ་ དང་ ལྡན་པ་ རྣམས་ ལ་ ནམས་ ཀྱང་ ཐུབ་པ ར་ མི་ འགྱུར་ གྱིས །_
en: Since we possess such qualities, they will never defeat us.

source: དེ་དག་ ལ་མ་ འཇིགས་ ཤིག་ མ་ འཇིགས་ ཤིག _། བདག་ ཀྱང་ དཔུང་ གི་ ཚོགས་ རབ་ཏུ་ མང་པོ ས་ ལྷ་མ་ ཡིན་ ག་ལ་བ་ དེར་ འགྲོ་བ ར་ བྱ་ ཡིས །_ དེ་དག་ ལ་ འཇིགས་ པར་མ་ བྱེད་ ཅིག _།
en: Have no fear of them. Do not be afraid. With this great army I am on my way to confront the asuras, so fear them not.

source: འཛམ་བུ འི་ གླིང་ ན་ ད་དུང་ དུ་མ ར་ འཛིན་པ་ དང་ །_ ཕ ར་ འཛིན་པ་ དང་ །_ དགེ་སྦྱོང་ དུ་ འཛིན་པ་ དང་ །_ བྲམ་ཟེ ར་ འཛིན་པ་ དང་ །_
en: In Jambudvīpa, people still respect their mothers, their fathers, mendicants, and brahmins.

source: བྱས་པ་ གཟོ་བ་ དང་ །_ ཆོས་ དང་ ལྡན་ ཞིང་ ཆོས་སྐྱོང་བ་ དང་ །_ དམ་པ འི་ [41b] ཆོས་ ལ་ དགའ་བ་ དང་ །_ དམ་པ འི་ ཆོས་ དང་ དགེ་འདུན་ ལ་ གུས་པ་ དང་ །_ ལས་ དང་ འབྲས་བུ འི་ དེ་ཉིད་ རིག་པ་ དང་ །_ གསོ་སྦྱོང་ ལ་ཉེ་ བར་གནས་པ་ དང་ །_ སྦྱིན་པ་ དག་ སྦྱིན་པ ར་ བྱེད །_ བསོད་ནམས་ བྱེད་པ འི་ རང་བཞིན་ ཅན་ དག་ རྗེས་སུ་ སྐྱོང་བ ར་ བྱེད །_ ཡེ་ཤེས་ ལ་ གོམས་པ ར་ བྱེད །_ དེ་ ལ་ ཡིད་ ཞུགས་ པར་ བྱེད་པ་ དག་ ཡོད་ ལ །_
en: They repay kindness. They are righteous and nurture the Dharma. [41.b] They take delight in the sacred Dharma, revere the sacred Dharma and the Saṅgha, understand the reality of karmic action and its effects, practice mending and purification, engage in generosity, sustain those who create merit, and train in wakefulness and commit themselves to it.

source: བདག་ གིས་ ཀྱང་ ཆོས་ དང་ འཐུན་པ འི་ ཆོས་ ཀྱི་ རང་བཞིན་ ཅན་ བསྒྲུབས་ ཏེ །_ དེ་དག་ དང་ བདག་ཅག་ ཉུང་ གིས་ ཀྱང་ ལྷ་མ་ ཡིན་ དུ་ གཏོགས་པ་ རྣམས་ ཀྱིས་ འཇིགས་པ་ མེད་ དོ །_།
en: I also act in accordance with the Dharma, so even if we should be fewer in number than them, those asuras will be unable to harm us.’

source: དེ་སྐད་ སྨྲས་ ནས་ ལྷ འི་ དབང་པོ་ བཻ་ ཌཱུརྱའི་ རི་ ག་ལ་བ་ དང་ །_ རྒྱལ་ཆེན་ བཞི འི་ ལྷ་ རྣམས་ ག་ལ་བ་ དེར་ སོང་ སྟེ །_
en: $301 “Having spoken those words, the ruler of the gods will then proceed to the beryl mountain where the gods of the Four Great Kings are assembled.

source: དེ་དག་ མངོན་པར་ མཐོང་ ནས་ ལྷ འི་ དབང་པོ ས་ སྨྲས་པ །_
en: When he sees them, the ruler of the gods will say,

source: འཇིག་རྟེན་ སྐྱོང་བ་ དག་ རྒྱལ་ཆེན་ བཞི འི་ ལྷ་ འདི་དག་ འཁོད་པ་ ནི་ ལྷ་མ་ ཡིན་ རྣམས་ ཕམ་པ ར་ བྱ་བ འི་ ཕྱིར་ འཁོད་པ་ ཡིན་ ནོ །_།
en: ‘Guardians of the world, these gods of the realm of the Four Great Kings have assembled to defeat the asuras.’

source: ལྷ འི་ དབང་པོ ས་ དེ་སྐད་ སྨྲས་པ་ དང་ །_ འཇིག་རྟེན་ སྐྱོང་བ་ དག་ གིས་ སླར་ སྨྲས་པ །_
en: “The guardians of the world will reply,

source: འདི་ལྟར་ རྒྱལ་ཆེན་ བཞི འི་ ལྷ་ འདི་དག་ ནི་ བརྒྱ་བྱིན་ ཁྱོད་ ལ་ རྟེན །_
en: ‘These gods of the Four Great Kings rely on you, Śakra.

source: ཁྱོད་ ལ་ སྐྱབས་ ཚོལ །_ ཁྱོད་ ལ་ གནས་པ་ ཁོ་ན་ ལགས་ ཏེ །_ ལྷ་མ་ ཡིན་ གྱི་ དབང་པོ་ ཚོགས་ དང་ བཅས་པ་ ཡང་ རྩིས་ ལ་མ་ ཆགས་པ ར་ བགྱིད་ དོ །_།
en: They take refuge in you, follow you, and have no regard for the hosts of asuras, including their rulers.’

source: དེ་སྐད་ སྨྲས་པ་ ན་ སུམ་ཅུ་རྩ་གསུམ་པ འི་ ལྷ་ རྣམས་ བརྒྱ་བྱིན་ ལ །_
en: $302 “The gods of the Heaven of the Thirty-Three will then march ahead to welcome Śakra, ruler of the gods.

source: ལྷ འི་ དབང་པོ་ བརྒྱ་བྱིན་ སྔོན་ དུ་ འདྲེན་པ་ དང་ བཅས་པ ར་ རྒྱལ་བ ར་ སྤྱོན་ ཅིག་ ཅེས་ གསོང་པོ ར་ སྨྲ་ ཞིང་ སྟོད་པ ར་ བྱེད་ དོ །_།
en: They shall sincerely beseech him, ‘Proceed and be victorious!’ and shall offer him their praise.

source: དེ་ ལྷ འི་ ཚོགས་ ཀྱིས་ བསྟོད་ ཅིང་ རྒྱལ་ཆེན་ བཞི འི་ ལྷ་ ག་ལ་བ་ དེར་ འདོང་བ ར་ བྱེད་ དོ །_།
en: Thus, while receiving the praises of the gathering of gods, he will proceed to where the gods of the Four Great Kings are staying.

source: དེ་ནས་ ལྷ འི་ དབང་པོ་ འཁོར་ དང་ བཅས་པ་ ཤིང་རྟ་ འབུམ་ཕྲག་ དུ་མ་ དང་ ལྷ འི་ ཚོགས་ ཀྱིས་ ནི་ ཡོངས་སུ་ བསྐོར །_ གླང་པོ་ཆེ་ ས་སྲུང་ གི་ བུ་ ལ་ ནི་ སྔ་མ་ བཞིན་ ཞོན །_
en: Surrounded by many hundreds of thousands of chariots, the ruler of the gods and his party will proceed, while Śakra rides his elephant, Airāvaṇa.

source: རིན་པོ་ཆེ་ སྣ་ བདུན་ གྱིས་ ནི་ མཛེས་པ ར་ བྱས །_ ནམ་མཁའ་ ལྟར་ རྟག་ ཏུ་ ལུས་ འོད་ ཀྱིས་ ནི་ གསལ་བ ར་ བྱས །_
en: He is adorned with the seven precious substances, and his body fills the sky with bright light.

source: ཕྱོགས་ བཅུ ར་ རོལ་མོ འི་ སྒྲ་ དང་ །_ སིལ་སྙན་ གྱི་ སྒྲ་ དུ་མ ས་ ནི་ བཀང་ །_ ལྷ་ ཡིད་ རབ་ཏུ་ དགའ་བ་ འབུམ་ཕྲག་ དུ་མ ས་ ནི་ ཡོངས་སུ་ བསྐོར །_
en: In all ten directions, the sounds of cymbals in myriad sizes can be heard as he travels with a retinue of many hundreds of thousands of ecstatically joyful gods.

source: རི་རབ་ ཐམས་ཅད་ ལ་ གནས་པ འི་ དྲི་ཟ་ རྣམས་ ཀྱིས་ ནི་ མཛེས་པ ར་ བྱས །_ ལྷ་ དང་ དྲང་སྲོང་ གི་ ཚོགས་ རྣམས་ ཀྱིས་ ནི་ མངོན་པར་ བསྟོད་ དེ །_
en: He is accompanied by the gandharvas that live throughout Mount Sumeru and is extolled by great hosts of gods and sages.

source: བདེ་བ་ དཔེ་མེད་པ་ [42a] ཉམས་ སུ་ མྱོང་ ཞིང་ལས་ ཀྱི་ འབྲས་བུ་ ཤིན་ཏུ་ ལེགས་པ་ ལ་ སྤྱོད་པ་ འོང་བ་ དག་ མཐོང་ ནས་ རྒྱལ་ཆེན་ བཞི འི་ ལྷ་ རྣམས་ ཡིད་ རབ་ཏུ་ དགའ་བ ར་ གྱུར་ ཏོ །_།
en: Thus, he travels in unparalleled comfort, [42.a] enjoying the karmic effects of his superb actions. $303 “When they see him in this way, the gods of the realm of the Four Great Kings will be completely overjoyed.

source: དེ་ནས་ དེ་དག་ མངོན་པར་ མཐོང་ ནས་ སྨྲས་པ །_
en: As Śakra beholds the gods, he will tell them,

source: འདི་ལྟར་ ང་ ནི་ ལྷ་མ་ ཡིན་ ཕམ་པ ར་ བྱ་བ འི་ ཕྱིར་ ང་ དཔུང་ ཆེན་པོ་ དང་ ལྷགས་པ་ ཡིན་ གྱིས་ མ་ འཇིགས་ ཤིག་ མ་ འཇིགས་ ཤིག _།
en: ‘I have come to conquer the asuras. Have no fear! Have no fear!’

source: དེ་ ཐོས་ ནས་ རྒྱལ་ཆེན་ བཞི འི་ ལྷ་ རྣམས་ ཡིད་ རབ་ཏུ་ དགའ་ སྟེ་ འདི་སྐད་ སྨྲས་ སོ །_།
en: “When they hear this message, the gods will be exultant and reply,

source: ལྷ འི་ དབང་པོ་ འདི་ལྟར་ ལྷ་མ་ ཡིན་ འདི་དག་ བདག་ཅག་ འབའ་ཞིག་ གིས་ ཀྱང་ ཕམ་པ ར་ བགྱི་བ འི་ སླད་ དུ་ མཆིས་པ་ ལགས་ ན །_ ལྷ འི་ དབང་པོ་ དང་ བཅས་པ ས་ ལྟ་ སྨོས་ ཀྱང་ ཅི་ འཚལ་ ཏེ །_
en: ‘Ruler of the gods, even on our own, we would have been able to defeat the asuras—so no need to mention that we will be able to do so now that you are here.

source: ཁྱོད་ ཀྱི་ དཔུང་ གིས་ བདག་ཅག་ བསྐྱབས་པ ས་ ན །_ ལྷ་མ་ ཡིན་ དུ་ གཏོགས་པ འི་ འཇིགས་པ་ ཆུང་ ཟད་ ཀྱང་ མ་ མཆིས་ སོ །_།
en: With the protection of your army, we have no fear of the asuras at all!’

source: དེ་སྐད་ སྨྲས་ ནས་ ལྷ་མ་ ཡིན་ ལྟ་བ་ ཁོ་ན ར་ འདོད་པ་ དེ་ ལ་ མངོན་དུ་ ཕྱོགས་པ་ ལྷ་ རྣམས་ ཀྱི་ དབང་པོ་ བརྒྱ་བྱིན་ དེ་ག་ ལ་བ་ དེར་ ཡོངས་སུ་ བསྐོར་ ཏེ །_
en: $304 “Eager to see the asuras, the gods who follow Śakra will proceed to form a circle around the ruler of the gods and take up their positions, thinking,

source: འཁོད་པ་ རྣམས་ འདི་ལྟར་ ལྷ་མ་ ཡིན་ གྱི་ དབང་པོ་ ཐགས་ བཟངས་ རིས་ དེ་ ལྷ་མ་ ཡིན་ གྱི་ དབང་པོ་ སྒྲ་གཅན་ དང་ །_ བརྟན་པ་ དང་ །_ མེ་ཏོག་ ཕྲེང་ དང་ །_ ལྷན་ཅིག་ དུས་ ཇི་སྲིད་ ཅིག་ ན་ འོང་བ ར་ འགྱུར་ སྙམ་ མོ །_།
en: ‘When will the asura ruler Vemacitrin arrive accompanied by the asura rulers Rāhu, Firm, and Puṣpamāla?’

source: དེ་ལྟ ར་ ལྕགས་ ཀྱི་ ཡ་ལད་ མི་ཕྱེད་པ་ བགོས་པ །_ ལག་ ན་ མཚོན་ཆ་ སྣ་ཚོགས་ ཐོགས་པ །_ ལྷ་མ་ ཡིན་ ཕམ་པ ར་ བྱ་བ འི་ ཕྱིར་ གཡུལ་ དུ་ ཆས་པ །_
en: Donning their indestructible iron armor and gripping their various weapons, they will thus prepare to defeat the asuras in battle.

source: ཡིད་ གཅིག་ ཏུ་ གྱུར་པ་ དག་ རིན་པོ་ཆེ་ རྣམ་པ་ སྣ་ཚོགས་ ཀྱིས་ མཛེས་པ ར་ བྱས་པ འི་ ཤིང་རྟ་ ལ་ ཞོན་པ་ རྣམས་ འཁོད་ དོ །_།
en: With one mind, they will line up in their chariots, which are adorned by numerous jewels.

source: དེ་ལྟ ར་ ཆོས་ དང་ ལྡན་ ཞིང་ ཆོས་ ཀྱི་ རྗེས་སུ་ འཇུག་པ འི་ ཀླུ་ འཇོག་པོ་ དང་ །_ ནོར་ རྒྱས་ ཀྱི་ བུ་ ལ་སོགས་པ་ གཡུལ་འགྱེད་ པར་ ཤིན་ཏུ་ ཆས་པ །_
en: $305 “At this time Takṣaka and Vāsuki and the other righteous nāga kings will also prepare themselves for war.

source: བརྒྱ་བྱིན་ ལ་ ལྟ་ ཞིང་ བཀའ་ གུས་པ ར་ ནོད་པ་ དག _། བརྒྱ་བྱིན་ གྱིས་ བཀའ་ ཅི་ཞིག་ སྩོལ་བ ར་ འགྱུར་ སྙམ་ ཞིང་ འཁོད་ དེ །_
en: Looking toward Śakra, and respectfully heeding his command, they will think, ‘What shall Śakra’s order be?’

source: དེ་ལྟ ར་ ས འི་ འོག་ མཐའ་དག་ ཀུན་ ལ་ མངོན་པར་ རྟོག་པ ར་ འདོད་པ་ རྣམས་ ལ་ ཇི་ལྟ ར་ ལྷ་མ་ ཡིན་ གྱི་ དབང་པོ་ བཞི་ ལྷ་མ་ ཡིན་ འཁོར་ དང་ བཅས་པ་ ཐམས་ཅད་ ཀྱིས་ ཡོངས་སུ་ བསྐོར་བ །_ ལག་ ན་ མཚོན་ཆ་ དང་ །_ ལག་ཆ་ སྣ་ཚོགས་ བྱེ་བ་ ཕྲག་ དུ་མ་ ཐོགས་པ་ ལག་པ ར་ ཤིན་ཏུ་ བསྡུས་ [42b] པ །_ ལག་པ འི་ སོར་མོས་ འཛིན་པ་ རྣམས་ ཀྱིས་ ཡོངས་སུ་ བསྐོར་བ་ དག་ རྣམ་པ་ དུ་མ ས་ ཆ་བ ར་ བྱེད་ དོ །_།
en: $306 “At this point, just as the gods are eagerly watching the entire subterranean world, the four asura rulers also stand surrounded by their retinues of asuras. Clenching many millions of weapons and arms in their hands, [42.b] they are arrayed in their various formations.

source: དེ་དག་ གི་ ཕྱི་བཞིན་ དུ་ ཡང་ འབུམ་ཕྲག་ བྱེ་བ་ དུ་མ་ དག་ གིས་ ཡོངས་སུ་ བསྐོར་ ཅིང་ །_ རི་རབ་ ཐམས་ཅད་ མཐུ་ཆེན་པོ ས་ སྒུལ་བ ར་ བྱེད་པ །_
en: $307 “As the asura rulers are surrounded by billions of asuras, they will shake the entirety of Mount Sumeru with their might.

source: ལྷ་མ་ ཡིན་ དེ་དག་ ཐམས་ཅད་ དང་ བཅས་པ །_ དཔུང་ དང་ བརྩོན་འགྲུས་ ལྷག་པ ར་ ཆེ་བ །_ མཚོན་ཆ་ དཔག་ ཏུ་ མེད་པ་ ལ་ མཁས་པ །_
en: Displaying tremendous military force and ambition, their army is expert at deploying an infinite array of weapons.

source: རི་རབ་ གཉིས་ ལྟ་བུ ར་ ཆ་བ་ ན །_ ཀླུ འི་ རྒྱལ་པོ་ ཆོས་ དང་ མི་ ལྡན་ ཞིང་ ཆོས་ ཀྱི་ རྗེས་སུ་ མི་ འཇུག་པ་ རབ་ འཇོམས་ ལ་སོགས་ པས་ ས འི་ འོག་ གི་ བདག་པོ་ ཐགས་ བཟངས་ རིས་ དང་ །_ རབ་དགོད་ ཡོངས་སུ་ བསྐོར་ ཏོ །_།
en: As mighty as a second Mount Sumeru, Pramatha and the other unrighteous nāga kings who do not follow the Dharma will now also encircle the lords of the subterranean world, Vemacitrin and Overjoyed.

source: དེ་ནས་ དེ་ལྟ ར་ ལྷ་ དང་ ལྷ་མ་ ཡིན་ འཁོད་པ་ དག་ ལྷ་ རྣམས་ ཀྱིས་ ནི་ ནམ་མཁའ་ བཀང་ ནས་ འཁོད །_ ལྷ་མ་ ཡིན་ རྣམས་ ཀྱིས་ ཀྱང་ རྒྱ་མཚོ་ ཁེབས་པ ར་ འཁོད་ དེ །_
en: $308 “In this way the assembly of gods will take their positions by filling the sky, whereas the assembly of asuras will take their positions by covering the sea.

source: ངོ་མཚར་ གྱི་ ཡིད་ ཀྱིས་ ཕན་ཚུན་ འཐབ་པ་ ལ་ ཤིན་ཏུ་ མོས་པ །_ ཕན་ཚུན་ དུ་ འཐབ་པ ར་ འདོད་པ་ ན །_
en: With minds filled with determination, the two armies thus stand before each other, eager to wage battle.

source: དེ་ལྟ ར་ ཀླུ འི་ རྒྱལ་པོ་ འཇོག་པོ་ དང་ །_ ནོར་ རྒྱས་ ཀྱི་ བུ་ ལ་སོགས་པ་ དང་ །_ འཇིག་རྟེན་ སྐྱོང་བ་ དེ་དག་ དང་ ལྷན་ཅིག་ འཁོད་པ་ རྣམས་ འདི་ལྟར་ ལྷ འི་ དབང་པོ ས་
en: $309 “Hungry for action, the army that includes Takṣaka and Vāsuki and other such nāga kings, as well as the guardians of the world, will now say to the ruler of the gods,

source: བདག་ཅག་ གི་ མདུན་ ན་ ལྷ་མ་ ཡིན་ དེ་ལྟ ར་ འཁོད་པ་ འདི་དག་ ལ །_ ལྷ་མ་ ཡིན་ དང་ བདག་ཅག་ འཐབ་མོ་ གྱིས་ ཤིག་ ཅེས་ ཇི་སྟེ་ བཀའ་ མི་ སྩོལ་ ཞེས་ བརྗོད་ དོ །_།
en: ‘Ruler of gods, the asuras stand before us. Why do you not give the command for us to instigate the battle between the gods and the asuras?’

source: དེ་ནས་ ལྷ འི་ དབང་པོ ས་ དེ་དག་ ལ་ འདི་སྐད་ སྨྲས་ སོ །_།
en: $310 “To this the ruler of the gods will reply,

source: འདི་ལྟར་ འཇིག་རྟེན་ སྐྱོང་བ་ དག་ འཛམ་བུ འི་ གླིང་ དུ་ རིངས་པ ར་ མངག་པ ར་ བྱ་ སྟེ །_ ཀྱེ་ འཛམ་བུ འི་ གླིང་ ན་མ ར་ འཛིན་པ །_
en: ‘Guardians of the world, I dispatch you to Jambudvīpa.

source: ཕ ར་ འཛིན་པ །_ ཆོས་ དང་ ལྡན་ ཞིང་ ཆོས་ ཀྱི་ རྗེས་སུ་ འཇུག་པ འི་ མི་ དག་ཅི་ ཡོད་ དམ་ མེད །_
en: Find out whether people respect their mothers and fathers, and whether they are righteous and follow the Dharma.

source: དེ་ལྟ ར་ བརྟགས་ ནས་ ལྷ་མ་ ཡིན་ རྣམས་ ཕམ་པ ར་ བྱ འོ །_།
en: Once you have examined this matter, we shall proceed to defeat the asuras.

source: ལྷ་ དག་ ནི་ ཆོས་སྐྱོབ་པ་ ཡིན །_ ཆོས་ ཀྱི་ གནས་ ཡིན་ ཏེ །_
en: The gods are protected by the Dharma and supported by the Dharma.

source: ཆོས་ འཕེལ་བ་ ན་ ལྷ་ རྣམས་ འཕེལ་བ ར་ འགྱུར་ ལ །_ ཆོས་ འགྲིབ་པ་ ན་ ལྷ་ རྣམས་ འགྲིབ་པ ར་ འགྱུར་ རོ །_།
en: When the Dharma flourishes, the gods flourish. When the Dharma declines, so do the gods.

source: དེ་ལྟ ར་ འཇིག་རྟེན་ སྐྱོང་བ་ དག་ མི་ཡུལ་ འཛམ་བུ འི་ གླིང་ དུ་ བདག་ གིས་ མངག་པ ར་ བྱ འོ །_།
en: Therefore, guardians of the world, I now dispatch you to the human realm of Jambudvīpa.’

source: དེ་སྐད་ སྨྲས་ ནས །_ ལྷ འི་ དབང་པོ་ བརྒྱ་བྱིན་ གྱིས་ འཇིག་རྟེན་ སྐྱོང་བ་ རྣམས་ ལ་ བསྒོ་བ །_
en: $311 “Śakra, the ruler of the gods, will then instruct the guardians of the world,

source: ཁྱེད་ འཛམ་བུ འི་ གླིང་ དུ་ མྱུར་ དུ་ དེང་ ལ །_
en: ‘You must quickly set out for Jambudvīpa.

source: འདི་ལྟར་ ཆོས་ དང་ ལྡན་ ཞིང་ ཆོས་ ཀྱི་ རྗེས་སུ་ འཇུག་པ །_ མར་ འཛིན་པ །_ ཕ ར་ འཛིན་པ །_ [43a] རིགས་ ཀྱི་ གཙོ་བོ འི་ རྗེས་སུ་ འཇུག་པ །_ གསོ་སྦྱོང་ ལ་ཉེ་ བར་གནས་པ །_ སྦྱིན་པ་ གཏོང་བ །_ ཚུལ་ཁྲིམས་ སྲུང་བ །_ བག་ ཡོད་པ་ རྣམས་ བག་ ཡོད་པར་ གནས་པ །_ རང་ གི་ ཆོས་ ཀྱི་ རྗེས་སུ་ འཇུག་པ་ དག་ ལ་སོ་ སོར་ རྟོགས་ ཤིག _།
en: Look for those who respect their mothers and fathers, [43.a] who follow their family leaders, who practice mending and purification, engage in generosity, observe discipline, are careful as appropriate, and observe their Dharma.’

source: དེ་སྐད་ བསྒོ་བ་ དང་ །_ འཇིག་རྟེན་ སྐྱོང་བ་ བཞི་ མདའ་ འཕངས་པ་ ལྟར་ ཤིན་ཏུ་ མགྱོགས་པ ར་ འཛམ་བུ འི་ གླིང་ དུ་ དོང་ ངོ་ །_།
en: $312 “When they have been given this instruction, the four guardians of the world will leave for Jambudvīpa as fast as when an arrow is released.

source: དོང་ ནས་ གནས་ ནས་ གནས །_ གྲོང་ ནས་ གྲོང་ །_ གྲོང་ཁྱེར་ ནས་ གྲོང་ཁྱེར །_ གྲོང་རྡལ་ ནས་ གྲོང་རྡལ །_ བཞི་མདོ་ ནས་ བཞི་མདོ །_ ཡུལ་ ནས་ ཡུལ །_ ལྗོངས་ ནས་ ལྗོངས །_ ཐམས་ཅད་ དུ་ སོ་སོ ར་ རྟོག་པ ར་ བྱེད་ དེ
en: As they visit every place, village, town, city, crossroad, land, and district in Jambudvīpa, they will inquire,

source: ཀྱེ་ འདི་དག་ ན་མ ར་ འཛིན་པ །_ ཕ ར་ འཛིན་པ །_ དགེ་སྦྱོང་ དུ་ འཛིན་པ །_ བྲམ་ཟེ ར་ འཛིན་པ་ དག་ སུ་ ཡོད །_ རིགས་ ཀྱི་ རྒན་རབས་ རྗེས་སུ་ སྐྱོང་བ་ དག་ སུ་ ཡོད་ ཅེས་
en: ‘Among the people here, who respects their mother, father, mendicants, and brahmins? Who takes care of the elders in their family?’

source: དེ་ལྟ ར་ འཛམ་བུ འི་ གླིང་ འདི་ མ་ལུས་པ ར་ སོ་སོ ར་ རྟོག་པ ར་ བྱེད་ དོ །_།
en: In this regard, they will find that in Jambudvīpa people are righteous and follow the Dharma.

source: དེ་དག་ གིས་ འཛམ་བུ འི་ གླིང་ ན་ ཆོས་ དང་ ལྡན་ ཞིང་ ཆོས་ ཀྱི་ རྗེས་སུ་ འཇུག་པ འི་ མི །_ མར་ འཛིན་པ །_ ཕ ར་ འཛིན་པ །_ དགེ་སྦྱོང་ དུ་ འཛིན་པ །_ བྲམ་ཟེ ར་ འཛིན་པ །_ རིགས་ ཀྱི་ རྒན་རབས་ རྗེས་སུ་ སྐྱོང་ སྟེ
en: They will see that people respect their mothers, their fathers, mendicants, and brahmins, that they take care of the elders in their families, and that they thus are endowed with all good qualities.

source: འཛམ་བུ འི་ གླིང་ གི་ མི་ རྣམས་ ཆོས་ ཐམས་ཅད་ དང་ ལྡན་པ ར་ མཐོང་ ངོ་ །_། དེ་དག་ གིས་ དེ་ལྟ ར་ རིག་ ནས་ ཡིད་ དགའ་ སྟེ །_ མདའ་ འཕངས་པ་ ལྟར་ ཤིན་ཏུ་ མགྱོགས་པ ར་ ལྷ་ རྣམས་ ཀྱི་ དབང་པོ་ བརྒྱ་བྱིན་ ག་ལ་བ་ དེར་ འོངས་ ནས་ ཡིད་ ཤིན་ཏུ་ དགའ་བ་ དེ་དག་ གིས་ ལྷ འི་ དབང་པོ་ བརྒྱ་བྱིན་ ལ་ འདི་སྐད་ སྨྲས་ སོ །_།
en: $313 “All this the guardians of the world will observe with joy, and, with the speed of an arrow released, they will return to stand before Śakra, ruler of the gods. With tremendous joy they will inform him,

source: ལྷ་ རྣམས་ ཀྱི་ དབང་པོ་ བརྒྱ་བྱིན་ དགྱེས་པ ར་ མཛད་ དུ་ གསོལ །_
en: ‘Śakra, ruler of the gods, please rejoice!

source: འཛམ་བུ འི་ གླིང་ ན་ ཆོས་ དང་ ལྡན་ ཞིང་ ཆོས་ ཀྱི་ རྗེས་སུ་ འཇུག་པ་ མི་ མར་ འཛིན་པ །_ ཕ ར་ འཛིན་པ །_ དགེ་སྦྱོང་ དུ་ འཛིན་པ །_ བྲམ་ཟེ ར་ འཛིན་པ །_ རིགས་ ཀྱི་ རྒན་རབས་ རྗེས་སུ་ སྐྱོང་བ །_ སྦྱིན་པ་ གཏོང་བ །_ བསོད་ནམས་ བགྱིད་པ་ དག་ མཆིས་ ཏེ
en: In Jambudvīpa, people are righteous and follow the Dharma. They respect their mothers, their fathers, mendicants, and brahmins. They take care of the elders in their families, they practice generosity, and they engage in that which is virtuous.

source: ལྷ འི་ ཕྱོགས་ ནི་ རབ་ཏུ་ འཕེལ་བ ར་ བགྱིད་ ལ །_ ལྷ་མ་ ཡིན་ གྱི་ ཕྱོགས་ ནི་ ཡོངས་སུ་ འགྲིབ་པ ར་ བགྱིད་ ལགས་སོ །_།
en: They are causing the forces of the gods to increase tremendously and the forces of the asuras to decline profoundly.’

source: དེ་སྐད་ སྨྲས་པ་ དང་ །_ ལྷ འི་ དབང་པོ་ བརྒྱ་བྱིན་ ཡིད་ རབ་ཏུ་ དགའ་ ནས
en: $314 “With great joy, Śakra, ruler of the gods, will then say,

source: འཇིག་རྟེན་ སྐྱོང་བ་ དག་ ལ་ སྨྲས་པ །_ འདི་ལྟར་ འཛམ་བུ འི་ གླིང་ ན་ ཆོས་ དང་ ལྡན་ ཞིང་ ཆོས་ ཀྱི་ རྗེས་སུ་ འཇུག་པ འི་ མི་ དག་ ཡོད་ [43b] པས་ ན །_ བདག་ཅག་ གིས་ ལྷ་མ་ ཡིན་ གྱི་ ཕྱོགས་ ཕམ་པ ར་ བྱ་ ཡིས་ ལྷ་ ཁྱོད་ ཀུན་ ཡིད་ དགའ་བ ར་ གྱིས་ ཤིག _།
en: ‘Since there are people in Jambudvīpa who are righteous and follow the Dharma, [43.b] I shall defeat the forces of the asuras. You gods, rejoice!’

source: དེ་སྐད་ ཐོས་ ནས་ ལྷ་ རྣམས་ ཡིད་ རབ་ཏུ་ དགའ་བ་ སྐྱེས་ ཏེ །_ ཡིད་ དགའ་བ་ བཅུ་འགྱུར་ དུ་ སྐྱེས་པ འི་ སྟོབས་ ཀྱིས་ བརྒྱ་བྱིན་ ལ་ སྨྲས་པ །_
en: “When they hear this the gods will be tremendously happy, and with great exultation they will call out to Śakra,

source: ལྷ འི་ དབང་པོ་ ཅི་ ལ་ གཞེས་ ཅི་ ལ་ གཞེས་ དགྲ་ ལས་ རྒྱལ་བ ར་ སྤྱོན་ ཅིག _། ཁྱོད་ ཀྱི་ བཀའ་དྲིན་ ལ་ བདག་ཅག་ གིས་ ལྷ་མ་ ཡིན་ རྣམས་ ཕམ་པ ར་ བགྱི འོ །_།
en: ‘Lord of gods, proceed, proceed!#248 May you be victorious over the asuras! By your kindness we shall defeat the asuras!’

source: དེ་སྐད་ སྨྲས་པ་ དང་ །_ ལྷ འི་ དབང་པོ ས་ ཀླུ འི་ རྒྱལ་པོ་ ནོར་ རྒྱས་ ཀྱི་ བུ་ དང་ །_ འཇོག་པོ་ ལ་སོགས་པ་ ལ་ འདི་སྐད་ སྨྲས་ སོ །_།
en: $315 “To Takṣaka, Vāsuki, and other such nāga kings the ruler of the gods will then say,

source: ཆོས་ དང་ མི་ ལྡན་པ་ ཀླུ་ རབ་ འཇོམས་ ལ་སོགས་པ་ དང་ །_ ལྷ་མ་ ཡིན་ ཐགས་ བཟངས་ རིས་ དང་ །_ རབ་དགོད་ ལ་སོགས་པ་ ཐམས་ཅད་ གཞོམ་པ འི་ ཕྱིར་ ཁྱེད་ རྒྱུགས་ ཤིག་ རྒྱུགས་ ཤིག _།
en: ‘Rush forth, rush forth to demolish Pramatha and the other nāga kings who lack the Dharma, and to vanquish Vemacitrin, Overjoyed, and the rest of the asuras.’

source: དེ་སྐད་ སྨྲས་པ་ དང་ །_ ཀླུ འི་ བདག་པོ་ འཇོག་པོ་ དང་ །_ ནོར་ རྒྱས་ ཀྱི་ བུ་ ལ་སོགས་པ་ ཀླུ འི་ བདག་པོ་ ཆོས་ དང་ མི་ ལྡན་ ཞིང་ ཆོས་ ཀྱི་ རྗེས་སུ་ མི་ འཇུག་པ་ ལྷ་མ་ ཡིན་ གྱི་ ཕྱོགས་ སུ་ གནས་པ་ རབ་ འཇོམས་ ལ་སོགས་པ་ ག་ལ་ བ་ དེ་དག་ གི་ དྲུང་ དུ་ ཁྲོས་པ འི་ ཤུགས་ ཀྱིས་ མེ་ཆར་ ལྟར་ འབེབས་ ཤིང་ རྒྱུག་ གོ །_།
en: $316 “Takṣaka, Vāsuki, and all other such nāga rulers will then proceed toward Pramatha and the other unrighteous nāga rulers who do not follow the Dharma and who are allied with the asuras. With great fury, they will bring down a rain of fire upon them.

source: དེ་ནས་ རབ་ འཇོམས་ ཡང་ ཐགས་ བཟངས་ རིས་ དང་ རབ་དགོད་ ཀྱིས་ བསྒོ་བ་ དང་ །_ དེ་དག་ འོང་བ་ མངོན་པར་ མཐོང་ ནས་ གློག་ ཆར་ ལྟར་ མངོན་པར་ འབེབས་ སོ །_།
en: In the meantime, however, Pramatha has similarly been counseled by Vemacitrin and Overjoyed. Thus, as they see them coming, they will, in turn, bring down flashes of lightning upon the advancing nāgas.

source: དེ་ རབ་ཏུ་ འབར་བ་ དེ་དག་ ཐམས་ཅད་ ཚ་བ འི་ སྡུག་བསྔལ་ མངོན་པར་ མྱོང་ ཞིང་ དེ་ནས་ ཡང་ ཕམ་པ་ དག་ ལྷ་མ་ ཡིན་ གྱི་ དཔུང་ ག་ལ་བ་ དེར་ རྒྱུག་པ ར་ བྱེད་ དོ །_།
en: Yet feeling the burning pain, the unrighteous nāgas will be forced to retreat to the asura army.

source: དཔུང་ དང་ མཐུ་ ཉམས་པ་ དེ་ ལྷ་མ་ ཡིན་ གྱི་ ནང་ དུ་ སོང་ ནས་ འདི་སྐད་ སྨྲས་ སོ །_།
en: With their military might and strength weakened, they will tell the asuras,

source: ཉམས་པ་ བདག་ཅག་ གིས་ རྒྱལ་བ ར་ དཀའ་ སྟེ །_
en: ‘We have been beaten so far, and winning will be difficult.

source: བདག་ཅག་ འདུས་ ན་ ནི་ བསྒྲིམ་ མི་ དགོས་པ ར་ ལྷ་ རྣམས་ ལས་ རྒྱལ་བ ར་ ནུས་ སོ །_། དེ་སྐད་ སྨྲས་ ནས །_
en: Still, if we rally together, we might be able to defeat the gods after all.’

source: དེ་ནས་ ཡང་ ཀླུ འི་ རྒྱལ་པོ་ འཇོག་པོ་ དང་ །_ ནོར་ རྒྱས་ ཀྱི་ བུ་ ལ་སོགས་པ་ ག་ལ་ བ་ དེར་ དོང་བ་ དང་ །_ དེ་དག་ འོང་བ་ འཇོག་པོ་ དང་ །_ ནོར་ རྒྱས་ ཀྱི་ བུ་ དེས་ མཐོང་ ནས་
en: With this, they will once more surge toward Takṣaka, Vāsuki, and the other righteous nāga kings.

source: སྨྲས་པ །_ འདི་ལྟར་ རབ་ འཇོམས་ བདག་ཅག་ གི་ དྲུང་ དུ་ འོང་བ་ ཆད་པ་ དྲག་པོ ས་ གཅད་པ ར་ བྱ འོ །_།
en: $317 “When Takṣaka and Vāsuki see them approaching, they will say, ‘Pramatha is surging toward us.

source: གཞན་ དུ་ ན་ དེ་ཡང་ དང་ ཡང་ དུ་ བདག་ཅག་ ལ་ འཚེ་བ ར་ བྱེད་ དོ །_། དེ་སྐད་ སྨྲས་ ནས །_ ཀླུ འི་ རྒྱལ་པོ་ རབ་ འཇོམས་ ལ་སོགས་ [44a] པ་ ག་ལ་བ་ དེར་ བརྒྱུགས་ ནས །_ འཇོག་པོ་ དེས་ རབ་ འཇོམས་ དེ་ བཟུང་ ནས་ སྟེང་ དུ་ མེ འི་ ཆར་ ཕབ་བོ །_།
en: We must punish him severely, because otherwise he will continue to harm us, again and again.’ [44.a] They will then storm toward Pramatha, seize him, and strike him with a rain of fire.

source: དེ་ མེ འི་ ཆར་ དེས་ རི་ དང་ བཅས་པ་ རབ་ཏུ་ སྲེག་པ་ ན །_ སྲོག་ འདོད་པ་ ལྷ་མ་ ཡིན་ གྱི་ ཕྱོགས་ ག་ལ་བ་ དེར་ རྒྱུག་པ ར་ བྱེད་ དོ །_།
en: The fire will even burn down mountains, and so, wishing to save their lives, Pramatha and the others will retreat back to the asuras.
